{"index":{"_id":"85","_index":"motorcycle_forum"}} 
{"Content":"Hi I'm Joe,\n\nBeen hooked on bikes since I was eight years old. I read a book in the school library called MINI BIKE CHALLENGE.\n\nFrom that day forth I was obsessed. I was fortunate enough to have parents who got me a beat up Broncco Diablo 4 years later on my 12th birthday. I jumped on and knew how to ride from practicing shifting on my bicycle. It was a pretty good first bike. Two stroke was great in the woods, 4 speed manual.\n\nAs I grew I bought a 1971 Honda SL 125 that was totally redone correctly for dirt. Next I had a 1979 CR125 that was one of the fastest bikes I've ever ridden for woods. It was only 2 years old and practically new.\n\nWhen I turned 18 I bought a two year leftover, 1981 XL500. It wasn't the greatest on the road or off but a lot of fun around town.\n\nThen I had an 81 shadow 500. What a fun quick versatile bike !!!!!\n\nFew years went by I bought a 2001 RM250 MX. Too fast for around my area, it was exhausting hanging onto that thing. No flow. Should have got another 125.\n\nThen I got into quads. Won a Wide Glide in a raffle. After less than a year I traded up to a Softail Heritage Classic. I can't say enough good things about that bike. It was like a mini bike for a full grown person. I rode days at a time on that, never sore.. just got tired of riding after a few years and got into other hobbies. Bought a Kawasaki Versys 650 off my brother. Had it for a year, sold it. It did nothing for me.\n\nNever had a race bike, bought a 2005 GSXR 600 last fall, it reignited my passion for riding again. Rode it WAY more than I thought it would.\n\nI kept it and bought a Ninja 1000 SX touring used a few weeks ago. It's similar to the GSXR but with creature comforts. All the tech, side hard bags. I can ride this bike all day long, take it on trips, run errands. It's my every day bike. Probably the last two bikes I'll own they are both great at what they were built for.\n\nHere's a pic of my 05 600 GSXR. No EPA emissions or computer ABS, traction control, it's not drive by wire. The last of a dying breed, it's a beast, redlines over 15,000 rpm, a true adrenaline machine...\n\n\n\nHere's a recent pic of my Ninja after putting the green accent stripes on the hard bags, I think they really set it off\n\n\n\nGood to be here, thanks for reading.\n\nJoe","Breadcrumbs":"Home\nForums\nWelcome To MotorcycleForum.com\n🆕 New Member Introductions 🆕","Title":"Lifelong Rider, new member","Author":"Joey Bones","URL":"https://www.motorcycleforum.com/threads/lifelong-rider-new-member.253782/","Date":"2024-04-28","Tags":[]}
