{"index":{"_id":"669","_index":"motorcycle_forum"}} 
{"Content":"About three weeks ago I go to local motorcycle dealer to look at new 2023 CFMOTO 300SS advertised for $3,000 and I had yet to be \"educated\" to motorcycle dealer fees.\nI know I have to pay sales tax, title, tag, probably some assembly and destination fees. Tax, title, and tag is ~ $400 actual cost, that I know; I figure maybe another $600 in \"fees\" so the motorcycle should be about $4,000 total, right? Wrong!!! They wanted $5,000 out the door with no extra warranty, just tax, title, tag, fees. A motorcycle advertised for $3,000 becomes $5,000 total which was quite a shock to the uninitiated.\n(Dealer adds fees to used bikes too).\n\nI decide to look for used motorcycles from individual sellers on Facebook marketplace.\n2021 Honda CBR300 with 4k miles, one owner - I have about 5k in it after tax, title, tag and a new rear tire.\n2021 Yamaha YZF R3 with 135 miles, one owner (it sat unused since 2021, they recently had fuel lines cleaned, oil changed ect... got it to running order and it runs great, I've put 100+ miles on it this week) I have just under 5K in it after tax, title, tag.\n\n(FL tax, title, tag was $416 & $430 on these and is based on reported sales price.)\n\n\n\n\n\n\nI have no plans to sell either, but IMO if I had to sell I'd probably lose less money on either of these than if I had bought a new 2023 CFMOTO 300SS for the same 5k that I have in each of these.\n\nI also think dealers should advertise the \"fixed\" fees they charge so potential customers are not blindsided when they go to a dealer to look at motorcycles. On their website they could say our sale price only is 3k and your total out the door price is \"only\" 5k. some dealers do that.","Breadcrumbs":"Home\nForums\nGeneral Forums\n🏍 General Motorcycle Discussion 🏍","Title":"New vs used and dealer shock.","Author":"CDW4ME","URL":"https://www.motorcycleforum.com/threads/new-vs-used-and-dealer-shock.253206/","Date":"2024-02-10","Tags":[]}
