{"index":{"_id":"29","_index":"motorcycle_forum"}} 
{"Content":"Hello all; my first post here!\n\nI have a 2020 SC c125 that I just purchased. It has 1200 miles on it and was serviced (First service) by the dealer at 580 miles. I noticed what sounds a bicycle with a baseball card clipped to the frame and that card contacting each spoke as the wheel turns (yeah, I'm old and we used to do this sort of thing in the 70's, as kids. I changed the oil for good measure, yet the valve train (or injector) noise remains. I adjusted the valves and I think there was a slight improvement. No noise at idle or WOT, but I can bring it on and higher RPMs (not redline high, mind you) when in-between rolling on/off the throttle - basically higher RPM, but not under load. I'm hoping someone here is familiar with the Super Cub c125 horizontal motor and can tell me if this is,\n\na) A normal characteristic of this motor (FI, valve train, etc.)\nb) Something else that needs addressing (CAM chain tensioner, valves, tappets, etc.)\n\nI asked the prior owner and of course, he said that noise was there from day one (\"a\" above).\n\nIf the consensus is defective CAM chain Tensioner, I was hoping to just drain the oil and pull the tensioner sealing bolt, spring, pushrod and pushrod head - and not have to pull the right case cover, flywheel, etc.\n\nIf normal, how can I quiet this engine some? Using 10w40, instead of 10w-30? Move from a 14T front sprocket to a 15T sprocket? Other?\n\nThanks for any tips or suggestions. Links about this (and the fix) would also be appreciated. I Google searched, and also YT, but didn't find much, aside from valve adjustment videos (and since it's not that...)","Breadcrumbs":"Home\nForums\nGeneral Forums\nFirst Bike / New Rider","Title":"Hello! Help needed to diagnose 2020 Honda Super Cub c125 engine noise...","Author":"Jebinc","URL":"https://www.motorcycleforum.com/threads/hello-help-needed-to-diagnose-2020-honda-super-cub-c125-engine-noise.253837/","Date":"2024-05-04","Tags":[]}
