{"index":{"_id":"140","_index":"motorcycle_forum"}} 
{"Content":"Leo is a lovely canyon carver, comfortable highway mile eater, and highly efficient traffic dispatcher. While it seems to be gaining weight as a meander through my 74th year lapping the sun, I have no thoughts of giving up its favorable attributes.\n\nHowever, it is quite unsuitable for keeping Piglet company when the spousal unit wants to take a short putt on our area's back roads. Dr Zee is just the prescription for that. He can follow her pace in 1st and 2nd gear with occasional shifts to 3rd when she 'opens er up' on paved stretches. Plus he is light and now, with the smaller wheels and tires, is easy for me to flatfoot and control at stops.\n\nHowever, Dr Zee is a bit buzzy on the main artery in our area where the limits and typical speeds are around 70 mph. So I picked up a vintage BMW to fill that space AND to have a cool, relatively sophisticated and reliable bike playing a bit of a double role there.\n\nTHEN I tripped over a nice 2011 BMW F650GS that could replace both Dr Zee and the R90 for about the same price. I rode it today and agreed to buy it by the end of the week.\n\nWhat a sweetheart. Spousal unit dreams it might replace THREE bikes, while I seriously doubt that, it is a whole bunch lighter than Leo and has some potential. I told her I am open to that as a possibility, but find it unlikely.\n\nThe new steed even comes with a zip-on tank bag and two aluminum hard cases... though if I was going far I still think Leo would get the nod. The 6-speed gearbox provides the right ratio for whatever I want at the moment and has a HUGE gear selector indicator removing all doubt. That and the analog gauges are all well thought out and the heated grip, signals and other switchgear look and work just like those on my R1200RT... familiar turf.\n\nThe GS putters along comfortably in the 15-25 mph range that Piglet enjoys, zips to 70++, cruises at 70++ without drama, accelerates quickly and easily in the 60-80mph overtaking zone, is at least 100 pounds lighter than Leo and feels well balanced at low and no speed. Its versatility has me thinking it could end up being \"Jack\" for Jack of all trades.","Breadcrumbs":"Home\nForums\nGeneral Forums\n🏍 General Motorcycle Discussion 🏍","Title":"taking a stir stick to the motorcycle stable","Author":"Bitterroot Bugler","URL":"https://www.motorcycleforum.com/threads/taking-a-stir-stick-to-the-motorcycle-stable.253729/","Date":"2024-04-21","Tags":[]}
