{"index":{"_id":"558","_index":"motorcycle_forum"}} 
{"Content":"https://www.motorcycleforum.com/threads/different-kind-of-motorcycle-mishap.253304/#post-2761794\n\nSparkman ended up in the hospital when his motorcycle fell off the ramp when he was trying to load it in the bed of a pick up truck.\n\nI have used ramps to load a small motorcycle -- a dirtbike that weighed less than 300 pounds-- into a pickup truck before, and that was do-able with two people. I could never do it alone \", but with two people we would push the bike up the ramp while we stood on the ground next to it, and then once it was in the bed one person would hold it steady (prevent it from rolling back out) while the other person climbed into the bed and pulled it in the rest of the way.\n\nClearly, what I did with that Yamaha 250 dirtbike or the Honda 125 before it would not work for a real motorcycle that weighs 450 to 750 pounds.\n\nI did Use my brothers four-wheel-drive pickup truck, to load my Honda Shadow 1100 (600 lb. cruiser) one time. The bike was able to start & run briefly. We backed his truck down to a spot in the front yard so the rear wheels fell into a ditch. That made his tailgate only a few inches higher than the grass. A scrap piece of plywood helped my wheel climb that slight little gain of elevation and I rode the bike into the truck bed. But, if his truck had been 2WD it may not have been able to pull itself out of the ditch.\n\nOh, one other time my Harley Davidson Sportster 883 (a 500 lb. cruiser) broke down near a church. My brother came to get it using only his pickup truck and not the landscaping trailer I hoped he would bring.\n\nThe bike was not running but I did manage to push it up a wheelchair ramp to the top of the stairs at the church's main entrance. My brother backed the truck up to the staircase and when we lowered the tailgate it lined up perfectly with one of the stone steps. So I straddled the bike, sitting on it, rolled it down the steps for about 4 feet of steep downhill rolling before it bounced into the bed.\n\n\nLet's talk about safe & effective techniques to load a decent sized motorcycle into a pickup truck's bed.\n\nAssume that we're talking about a normal tailgate height for a full sized pickup.","Breadcrumbs":"Home\nForums\nMotorcycle Repair, Building, and Restoration\nHow To","Title":"How to use Pickup Bed to Transport","Author":"gunsmoker","URL":"https://www.motorcycleforum.com/threads/how-to-use-pickup-bed-to-transport.253320/","Date":"2024-02-29","Tags":[]}
