{"index":{"_id":"539","_index":"motorcycle_forum"}} 
{"Content":"I picked up a neglected 85 XJ700 last fall. The factory Hitachi carbs are beyond repair. I thoroughly cleaned and attempted to rebuilt them by the book, But I believe they are too far gone. With the clean rebuilt stock carbs installed, new battery and fresh gas gravity feed from separate test tank, the bike cranks no start and every now and then a fire ball is visible at exhaust tip.\nI have a pristine set of 4 Mikuni BSR32SS carbs off of a 98-06 Suzuki GSX600F Katana, that I would like to run on the XJ700.\nThe problem I have is the current intake boots do not line up with the Spacing of the Mikuni carbs.\nI have been searching for different intake boots and I found a few that may work ( Kawasaki zx750 zephyr, Yamaha xj900f, Suzuki GS850 intake boots) based on 32mm carb side port, xj750 head port size , orientation (/ / \\ \\)and fastener hole spacing. The unknown variable that I am eyeing and guessing is the amount of offset needed the get the spacing correct. There is not a lot of technical info on intake boots making it difficult to choose a set that will work. I will post all the known center to center port spacing, carbs and head, as soon as I find my notes or remeasure. There has to be a more scientific, accurate way to figure this out aside from trial and error by firing the parts cannon at it with boots that look like they might fit.\nI also considered keeping the stock boots and buying flexible adapters. This could work but the adapters would have to be very short because space is limited. If the carbs are situated an inch or 3 back due to adapters/spacer tubes, will that have any negative effects?\nI am open to any suggestions . Thanks in advance.","Breadcrumbs":"Home\nForums\nGeneral Forums\n🏍 General Motorcycle Discussion 🏍","Title":"85 XJ700 help fitting Mikuni BSR32SS carbs.","Author":"mooretodd007","URL":"https://www.motorcycleforum.com/threads/85-xj700-help-fitting-mikuni-bsr32ss-carbs.253353/","Date":"2024-03-04","Tags":[]}
