{"index":{"_id":"328","_index":"motorcycle_forum"}} 
{"Content":"The Mercedes Brabus which is a Super Duke with different styling and no performance difference, is only $26,000.00 extra for the styling. The first release of 154 bikes, took a long, long time to sell....all of 2 minutes!\n\n\nNEWS\nBrabus 1400 R on Way\nAnother special-edition, Brabus-styled KTM Super Duke on the way.\n\n\nBy Ben Purvis\nMarch 11, 2024\n\n\nThe Brabus and KTM collaboration continues with an upcoming trio of models similar to the 1300 R Masterpiece Edition seen here.Brabus\nBrabus has been a name synonymous with modified Mercedes since the late ‘70s but made the leap to two wheels with the Brabus 1300 R in 2022 and has found there’s plenty of customers prepared to pay high prices for a Brabus-branded bike. Now the company has filed three trademark applications for new Brabus 1400 R models—essentially confirming its collaboration with is set to extend with more –based bikes.\n\nThe was based on the , adopting its engine and chassis (unaltered) and wrapping them in distinct styling that included a round headlight borrowed from . The first generation was made in a limited run of 154 bikes (77 in red and 77 in black) to mark the company’s foundation in 1977. Despite a price equivalent to nearly $45,000 and no performance advantage over the $19,000 Super Duke Evo it was based on, all 154 were sold within two minutes of the order book opening.\n\n\nThe original Brabus 1300 R.Brabus\nUnsurprising, then, that Brabus added a in 2023, the 1300 R Edition 23, with production increased to 290 examples. Again, these were split 50/50 between two colors, Superblack and Stealth Gray, and there were tweaks to the styling including a new headlight cowl and air intakes. Once again, they were snapped up fast, and Brabus launched the third version, , just a few months later. This was more exclusive with just 50 made, 25 in white and 25 in black, and Brabus promised it was the last in the line.\n\n\nThe latest Brabus is based on KTM’s new-for-2024 1390 Super\nNow, of course, the is gone, replaced for 2024 by , so there’s scope for Brabus to do it all over again with a line of bikes using the updated 1,350cc engine from the new model. Complete with a shiftcam-style variable valve timing and lift system, the new motor puts out a claimed 190 hp at 10,000 rpm and 107 . at 8,000 rpm, up from 177 hp and 103 .\n\n\nThat engine, along with the latest Super Duke Evo’s chassis, suspension, and brakes, is sure to be the underpinnings of the new generation of Brabus bikes. The three trademark applications filed so far suggest that Brabus might be looking at the same idea as before, of offering three separate runs of bikes. The first trademark is for the name Brabus 1300 R Rocket. “Rocket” is a title that Brabus already applies to some of its limited-edition, high-end Mercedes cars so it’s a logical way to connect the two- and four-wheeled output of the brand. We’ve already seen with the and limited-edition bikes that there’s an appetite from collectors to buy bikes that match their high-end automobiles. But it’s not hard to imagine that , which already sells bikes using the name , might object to Brabus’ plans to make a Rocket-branded motorcycle. We’ll have to wait and see whether the trademark application gets approved.\n\nThe second trademark application is for the term “Brabus 1400 R Signature.” Again, Brabus already uses the term “Signature” on its existing output, but for its range of high-end boats rather than its cars. Nothing says you’ve got money to spare more than an exotic boat, except perhaps having a matching motorcycle to go with it.\n\nFinally, at least for the moment, there’s the trademark application for the title “Brabus 1400 Tailor Made.” The Tailor Made name digs back into the past for Brabus, as the company made a line of expensive, modified versions of the Smart ForTwo minicar under the same branding back in 2010.","Breadcrumbs":"Home\nForums\nMotorcycle Related News\nMotorcycle News Articles","Title":"$45,000.00 or $19,000.00 A Sheep In Wolf's Clothing","Author":"Steadfastly","URL":"https://www.motorcycleforum.com/threads/45-000-00-or-19-000-00-a-sheep-in-wolfs-clothing.253547/#post-2765096","Date":"2024-03-31","Tags":[]}
