{"index":{"_id":"678","_index":"motorcycle_forum"}} 
{"Content":"Did you ever try to make your own windshield?\nWell, a few months back, I decided to try.\nNow, I've made windshields before, and for most bikes, it's not too difficult, since they are basically flat.\nBut the Goldwing 1500's shield is not so easy.\nThis project has been giving me agita for months. The 1500's windshield is a complex shape with a compound curve to it, plus it has five mounting slots near the bottom which engage the adjusters that let you move the shield up or down. Making one out of a flat sheet of Lexan was a pain in the....well, you know where.\nI finally finished it today and got it mounted!!! Yee ha!\n\nThe original windshield had become foggy and scratched over the years. So last year I bought a replacement from some aftermarket dealer. It was a nice windshield, (aside from costing a small fortune) but it was too thick, so the adjustment mechanism no longer worked right. There was no way I could move it up or down. Plus, the compound curve was even more exaggerated than the original, which warped the view and gave me a headache when looking at things close in front of me, like the white line on the road, or Jersey potholes!\nSo I set about making my own from a flat sheet of Lexan from Amazon. I started and stopped on this project several times over the last few months, trying to figure out how to trace that odd compound shape onto a flat sheet of Lexan, and how to cut those five mounting slots so the adjuster would work.\nFinally, this morning it all came together. It was was a pain but worth it. And it only cost a fraction of what a aftermarket shield costs. I think I paid $46 for a sheet of eighth inch thick Lexan from Amazon.\nThe aftermarket shield that I bought last year cost around $200!!\nSo I'm a happy man. I now have a flat windshield that doesn't distort the view ahead.","Breadcrumbs":"Home\nForums\nGeneral Forums\n🏍 General Motorcycle Discussion 🏍","Title":"The windshield chronicles","Author":"Offcenter","URL":"https://www.motorcycleforum.com/threads/the-windshield-chronicles.253195/","Date":"2024-02-08","Tags":[]}
