{"index":{"_id":"70","_index":"motorcycle_forum"}} 
{"Content":"Hey guys, got a weird one here, looking for some insight perhaps. Please keep in mind, I am a beginner motorcyclist, but I am trying my best to learn how to ride AND maintain these amazing machines!\nJust traded a 2002 Honda Shadow 750 Spirit to a kid who was getting rid of a 2001 Yamaha R1 1000. Apparently it was too fast for him and he really just wanted a cruiser, okay. Bike has a few cosmetic dings, nothing I'm worried about, and also needs a new battery (The current one is so bad that headlights don't even stay consistently bright during a drive, and you cannot start without a jump), which is only gonna run 50 dollars. However, one thing he said was that the previous owner had put an aftermarket slip-on exhaust on the bike, and now the \"bike needs a tune up to unlock the full power of the bike\", which sounded like dookie to me.\nHaving 0 experience with slip-on's, i decided to test the bike, and god does it have no power! If I attempt to get the bike going from a standstill at anything lower then 5k RPM, the bike will almost certainly stall if i don't pull the clutch immediately, and even moving in first gear, wide open throttle, RPM's increase very slowly and it can take up to 10-20 seconds just to get to 70-ish MPH. At some point the RPM's can reach redline, and at some point I can exceed 100 MPH or more, but there ain't no way this is caused by a simple slip-on, I'm not that dense.\nTomorrow morning I am going to pull the slip-on off and do a quick test, see if it ACTUALLY has that kind of impact, but on the chance that I am right and its not the exhaust, what could possibly be doing this to this poor bike? Part of me wants to assume it is related to the clutch because acceleration is so poor, but at the same time if it was the clutch, the RPM's would go up but speed wouldnt.. right?\nAny and all help is appreciated. Thank you guys so much!","Breadcrumbs":"Home\nForums\nMotorcycle Repair, Building, and Restoration\n🔧 Motorcycle Repair 🔧","Title":"01 Yamaha R1; needs high RPM to get rolling and has very poor acceleration/torque","Author":"RyanM8640","URL":"https://www.motorcycleforum.com/threads/01-yamaha-r1-needs-high-rpm-to-get-rolling-and-has-very-poor-acceleration-torque.253795/","Date":"2024-04-29","Tags":[]}
