{"index":{"_id":"540","_index":"motorcycle_forum"}} 
{"Content":"Hello all!\nI'm new to this forum, I recently purchased a couple of '89 Honda VTR 250 Interceptors for my wife. One is showroom condition with only 2563 original miles, the other is in Very Good condition with only 13,068 miles.\nThe first one looks like it just rolled off the showroom floor. The gentleman who owned it is an Irishman with little mechanical knowledge and he did an oil change himself, only problem is, he forgot to add new oil and locked this one up after riding it a couple miles...\nThe other is in really nice shape with more miles on it and more signs of wear and tear, but it has been well cared for and needed the carbs rebuilt and here is where the issue comes in...\nThe first bike I found all internal parts and pieces with all of the bolts and pistons with rods and rings, all of the timing chains and chain tensioners as well as an oil pump and pick up, the coolant piece that holds the thermostat as well as all kinds of electrical and mechanical bits to repair the seized engine.\nThe second bike, I did it to myself and I am not proud of what I did, but I did it and I will admit it... The carbs were gone through by me and I added fuel and allowed it to run for quite a while, brought the temp up to normal and thought it was all good. However after installing the fuel tank and adding about a half a gallon of fuel, the rear carb float was not right and I hydrolocked the engine...\nI'm a mechanic for decades and was the shop forman in a Cadillac, Rolls Royce, Bentley dealership on the north shore of Chicago for years, I am also quite knowledgeable about Honda and Kawasaki road bikes, I was an Iron Butt rider and did 1000 mile days for years...\nSo, I pulled the plug and spun the engine over and fuel squirted out, but I thought it needs to spit more out and when I did the second spin over the dang thing blew more fuel out and you know what happened then...\nSo, now I am repairing and replacing anything that had fire damage, which in the grand sceme of things is VERY little. But I need the petcock knob which got a little melted and I have already found a seat cover and wiring harness bits which were slightly melted, but I learned my lesson... I cannot believe that I did that!\nI have a 1975 Honda CB 750 F Super Sport that has only 8218 miles on it from new. It has sat outside in the desert for a while, but the wiring, seat and other stuff still looks new, he was smart enough to remove a bunch of stuff and then it just sat, I have to finish rebuilding the carbs on that bike, but I was more into getting my wife's VTR running...\nI'm gonna need some pieces and parts and hope that someone on here can help with getting the bits I need...\nThanks, sorry I am long winded and had to tell all from the getgo!\ndmkberger","Breadcrumbs":"Home\nForums\nWelcome To MotorcycleForum.com\n🆕 New Member Introductions 🆕","Title":"Here I am... Two 1989 Honda VTR Intercepters and one 1975 Honda CB 750F Super Sport","Author":"dmkberger","URL":"https://www.motorcycleforum.com/threads/here-i-am-two-1989-honda-vtr-intercepters-and-one-1975-honda-cb-750f-super-sport.253349/","Date":"2024-03-03","Tags":[]}
