{"index":{"_id":"791","_index":"motorcycle_forum"}} 
{"Content":"I'm new to riding, about 4 months now and recently I've been having this issue with my bike. It's a yamaha v-star 250 from 2012 with about 8100 km on it. I've been riding in cold weather so far anywhere from -2 to 8 degrees celsius. Had a similar issue with the motorcycle about 2 weeks ago when I was on my way to my friend's house (which is 50 km away) where it just died on a hill after spluttering and it would not start back up (it would start for about 10 seconds then it would just die). I got my friend who is a mechanic and we checked the air filters, changed the spark plugs, checked all connections and the battery then figured that after spraying starting fluid in the motorcycle it would come back to life, so he said that it's a big chance the carburetor jets are clogged (which they were), we took apart the motorcycle and fully cleaned the carburetor and there were a lot of jets that were clogged. After that the motorcycle ran perfectly and I drove the 50km back to my home with no problems in 1 degree weather. Fast forward to now 2 weeks later and I'm having issues again, I was on the way to my university today when the motorcycle just started spluttering then it just straight up died in the middle of the road. Had to go on the sidewalk and try to start it back up again. Wouldn't start but after a few minutes of trying it started back up with the choke, then i lowered the choke and it ran fine. After that I decided to try to make it to my university which was only 1 km left away and just as i was about to reach it, the motorcycle died again. Spluttered and then died. Did the same thing, went on the side and had the motorcycle run on full choke. This time the RPMS were getting really high, then getting really low, and it would do this for a few minutes until it just came back to life and sounded normal. After that I went to park it. When I got back to my motorcycle (2 hours later) I started with the choke full (everything fine) warmed it up for 5 minutes until I could feel the heat coming from the side and left with bike. 3 minutes later it just died again the same way it died previously, this time after starting it back up it would do the same thing, splutter then die when coming to a stop sign. Somebody came by and tried to help me with the bike, we adjusted the idling speed of the bike and turned it to the right. Did not help. He also told me that he has a carburetor bike as well and has the same problem when riding in cold weather. Got any ideas what this could be? any help would be appreciated\n\nAlso I would like to mention that every time I go out riding in the rain my motorcycle start having the same issues, it seems to splutter and then die at low rpm in the rain. Fuel pump was not opened up and cleaned, we did take the line off and cranked it and it did push out fuel at a steady rate. The motorcycle did not sit in garage for longer than 1-2 days when it was snowing, I've gone out with the motorcycle pretty much every single day if it didn't snow.","Breadcrumbs":"Home\nForums\nMotorcycle Repair, Building, and Restoration\n🔧 Motorcycle Repair 🔧","Title":"Motorcycle starts spluttering then dying when starting from a full stop","Author":"AndreiScheianu","URL":"https://www.motorcycleforum.com/threads/motorcycle-starts-spluttering-then-dying-when-starting-from-a-full-stop.253036/","Date":"2024-01-13","Tags":[]}
