{"index":{"_id":"841","_index":"motorcycle_forum"}} 
{"Content":"Hi\n\nI have ridden bicycles my entire life. I have also ridden a \"70cc TVS XL super\" (gearless motorcycle).\nMy height is 170cm.\n\nI need to buy a motorcycle to commute to work, 5 days a week.\n35km to go to work in the morning and 35km to go home in the evening.\nTraffic jam in the last quarter before reaching workplace.\nMost of the journey i will ride from 60km/h to 80km/h.\nSometimes I may ride higher than 80km/h.\nThe weather is sunny most of the time.\n\nI only have MUR 120,000 (about USD 2,727). I can buy on credit if necessary.\nOn average I can spend up to MUR 150,000 (credit)\nDefinitely, not going above MUR 200,000 (credit)\n\nI have so many questions:\n1) Is it worth it to buy a motorcycle and to learn to ride with clutch?\nOr new motorcycles in the future will be automatic like the Yamaha PG-1 ?\nConsider that I will probably never ride a motorcycle above 300cc.\nI will prefer motorcycles that are around 150kg or less.\n\n2) Should I buy a scooter TVS Jupiter 125 (about MUR 100,000) ?\nI don't like scooters but since it is automatic, maybe it would be easier.\nNo offense, but in my mind, motorcycles are more manly.\n\nMotorcycles in my country that I like:\n1) Yamaha YBR125-ED(MUR 90,000) It probably is an old model still being sold. [ ]\n2) KTM Duke 125, 200 - Don't know the price yet. Not sure if I will get spare parts easily later. How much maintenance will cost?\n3) Yamaha XSR 155 - My favorite but it's too expensive (MUR 200,000). Commuting may increase maintenance costs.\n4) V-Strom 250 SX (DS 250) - (MUR 145,000) This is also so good. I need to go and check if I am tall enough. [ ]\n5) Suzuki En125-2a - My least favorite. (MUR 90,000) [ ]\n\nThings I care about a lot:\nFuel Consumption, Top Speed, Maintenance cost, cruising speed above or equal to 60km/h\n\nI know this a long post.\nThank you for reading.","Breadcrumbs":"Home\nForums\nGeneral Forums\nFirst Bike / New Rider","Title":"Commuting to work and leisure rides","Author":"Akashv108","URL":"https://www.motorcycleforum.com/threads/commuting-to-work-and-leisure-rides.252975/","Date":"2024-01-02","Tags":["commuter","first bike","leisure","motorcycle"]}
