{"index":{"_id":"177","_index":"motorcycle_forum"}} 
{"Content":"First off I want to say I am not trying to call out any person or specific group here, this is just a general observation.\n\nMost of my experience is with cars and car hobby culture, and sure people do all sorts of dumb stuff with cars and there is some misinformation floating around, but with motorcycles it seems to be on a whole different level, possibly several new levels.... It constantly amazes me how many competitively dumb choices it seems like are made so regularly in this already dangerous hobby. I mean we know it is a hobby you need to exercise care with, yet the amount of misinformation and just sheer overwhelming amount of WTFtitude I see on a regular basis blows my mind.\n\nOhh you removed your mirrors and/or front brakes from your street bike because you think it looks better? Really, you think that is a good plan? Even if you keep your front brakes you are sure you shouldn't ever use them unless it is a dire emergency then just squeeze as hard as you can and pray huh?\n\nI know people are genuinely hurt by inattentive drivers, and whether you could have avoided it or not, it sucks you got injured, and I do feel for you, but also I seem to be constantly hearing stories where I am thinking stuff like:\n\nI am sorry that guy cut you off and caused you to skid a few dozen feet then slam into him so hard you lodged your bike under their car because he didn't see you or failed to predict how fast your were going at a 2 way stop in town. But also.... How fast were you going to skid so far then hit a car so hard it was lifted up and slammed down on your motorcycle when the speed limit was likely 30-35mph? Have you been practicing threshold braking? Been keeping up with your front tire? Because something doesn't add up here....\n\nOhh someone hit you right as you were pulling out of your driveway and you got injured? I am really sorry to hear that, but also.... Why did you pull out right in front of a car? Were you expecting them to watch out for your safety and slam on their brakes to avoid hitting you?\n\n\n\nThere is just so often I am left shaking my head and honestly surprised casualty rates are not higher than they are in this hobby.","Breadcrumbs":"Home\nForums\nGeneral Forums\n🏍 General Motorcycle Discussion 🏍","Title":"Anyone else surprised motorcycle injuries are not more common?","Author":"Joel_The_Mole","URL":"https://www.motorcycleforum.com/threads/anyone-else-surprised-motorcycle-injuries-are-not-more-common.253675/#post-2766517","Date":"2024-04-15","Tags":[]}
