[{
  "Content": "Hi all, newbie rider here (3 months in so far).\n\nHave a couple of questions/observations and opinions needed here.\n\nLive in Australia, on my L's, when u are on your learners plates, you must wear a fluro jacket (armless).. Coming from a road cycling background, I kind of don't mind it, I like being visible on the road, and let's face it my motorbike travels a hell of a lot faster than my bicycle. Equates to drivers having less time to notice me on the motorbike.\n\nI'm on my L's for another month or so most likely, as have been riding a fair bit practising a lot of drills/skills and riding on all kinds of roads, so fingers crossed, pass it, then can take the fluro vest off. However, I'm thinking I am way more visible with it on, also have a white helmet, and ride with headlights on high during day. I really try to ride safely, and most importantly be seen, as In riding like I'm invisible out there to all other road users.\n\nIt doesn't look very cool or sharp with the vest on. Everyone here, esp the guys who ride cruisers/Harleys etc, ALL wear black everything, seems like people on sports bike/touring have a little more colour in their motorbike attire.. Is that normal in other countries?\n\nDoes anyone consistently wear fluro vests or other fluro gear out there?\n\nOn a side note I noticed a few bikes with an additional light, one that flashes, similar to what I use on my bicycle. Anyone have any thoughts on those.\n\nSafety V Style... I kinda lead towards anything that will make me more visible, even if I end up looking like a newbie for the rest of my life.\nLove your thoughts and opinions on this.\nAndy",
  "Breadcrumbs": "Home\nForums\nGeneral Forums\nMotorcycle Training, Safety, and Riding Techniques",
  "Title": "Hi Viz or not? Do we want to be more visible out on the road or looking cool wearing all black?",
  "Author": "AndyC70",
  "URL": "https://www.motorcycleforum.com/threads/hi-viz-or-not-do-we-want-to-be-more-visible-out-on-the-road-or-looking-cool-wearing-all-black.253505/",
  "Date": "Mar 24, 2024",
  "Tags": []
}]