[{
  "Content": "Thanks to anyone who cares to have a look! I'm just a little lost on what else needs to be done to my bike to get it running smoothly again.\n\nI recently bought my bike and have had some electrical issues which I thought I had sorted but it's still feels strange. My headlight was flickering pretty badly and was quite dull, so I replaced it with a LED headlight just so i felt more comfortable - country roads around Devon at night are fairly sketchy.\n\nOn top of this, there was suggestion that there could be an issue with my regulator, so I replaced it. When that didn't solve the issue and my bike crapped out on me, I replaced the battery which did help with working semi-normally again. Most recently it seemed to be working perfectly until I was riding to work last night and noticed my heated-handlebar grips turned off by themselves again after about 15/20 mins of riding. They were already struggling to stay on before the new battery so this was puzzling as to why it started this issue again. I also noticed that it struggled to accelerate in every gear, however my suspicion is I need to change the oil and air filter (yay for more learning )\n\nSo I finally changed the alternator today, fresh oil and other tune up as necessary and noticed that my headlight is still flickering. Futhermore it struggles to stay on after turning on unless I give it plenty of revs/have the choke on.\n\nAnyone have any suggestions on where to look next? For now I need to focus on the basic functionality and once I have some more money in my pocket I replace more parts if necessary (only recently returned to my home country and have pretty much no money)\n\nThanks again for any suggestions anyone has\n\nAnyone ha",
  "Breadcrumbs": "Home\nForums\nMotorcycle Repair, Building, and Restoration\n🔧 Motorcycle Repair 🔧",
  "Title": "2001 Suzuki GS500e issues",
  "Author": "claudia.vigar7946",
  "URL": "https://www.motorcycleforum.com/threads/2001-suzuki-gs500e-issues.253476/",
  "Date": "Mar 21, 2024",
  "Tags": [
    "acceleration",
    "electrical issues",
    "suzuki gs500e"
  ]
}]