[{
  "Content": "Hey there, everybody!\n\nI'm restoring a Yamaha Road Star, and I had smoke coming from my 2-1 exhaust and backfires galore again after I did a valve adjustment. The exhaust valves on the rear cylinder as well as the intake valves of the front cylinder were fine. I had a theory that oil was getting into the rear cylinder some how, so I took the junction off the exhaust system and left two wide open pipes for me to confirm that the rear cylinder is the culprit for the smoke, and the front for the backfires.\n\nWhat I discovered was exactly that, but also that the rear cylinder isn't even firing. Frankly, I'm embarrassed that I didn't discover this sooner, but it is what it is. Then I took the head off of the rear cylinder and this is what I found.\n\n\n\n\nIf I'd only had been working with daylight instead of garage lights when I was adjusting the valves I'd have probably noticed the discoloration even with the valve spacer where it was. I was only expecting bad piston rings, and I didn't get look into that further; not that it matters since I've already got two sets of the oem piston rings on the way. I've decided that I'm just gonna replace all the gaskets from the bottom-most gaskets on up, replace both pistons' rings, and, now, I guess that I'm replacing the exhaust valves and cleaning the valve seats. I don't know. I haven't been able to inspect it further, except from the pictures and from the discoloration I can tell that one exhaust valve in particular is responsible\n\nWhat I'm interpreting from all of this is that combustion is getting into the valve chamber. So that means that valves were stuck open during combustion. Or, that oil is coming up from the piston rings and is mucking up the combustion by soaking and interfering with the spark plugs, which leads to leftover gasoline getting up into the valve chamber and burning up in there? What does this look like to folks who do this for a living?",
  "Breadcrumbs": "Home\nForums\nMotorcycle Repair, Building, and Restoration\n🔧 Motorcycle Repair 🔧",
  "Title": "Rear Cylinder teardown (Yamaha Road Star 1600)",
  "Author": "Gadfly",
  "URL": "https://www.motorcycleforum.com/threads/rear-cylinder-teardown-yamaha-road-star-1600.253007/",
  "Date": "Jan 7, 2024",
  "Tags": []
}]