[{
  "Content": "Happy Spring everyone!!!\nYeah, I know it was yesterday but I was busy taking a little ride, 1023 miles of a ride, to be exact. This was not just a ride, but an Iron Butt Association SaddleSore 1000 , and it was one of 4 required for the 4 season rider Award, one on each Solstice and each Equinox. This one completes my set, and I applied and am waiting for the award.\nI had started with the 'hard' one, the Winter solstice, then got the Summer and Fall but the 'easy' Spring one defied me, the weather is notoriously fickle this time of year, I was skunked twice and this year was no exception, we went from perfect warm weather Saturday to freezing rain on Sunday and the wild weather kept coming.\nI was determined to get this certification this time though, I watched the weather, it looked good so I took off the day from work and went to bed, woke up at 0230 and looked at the radar...and saw SNOW all over. NOT AGAIN!!!\nI was upset, aggravated, and annoyed, so I kept watching radar, trying to figure out the weather's track, googling webcams to see if it really was snowing, and it WAS!\n\nI was ready to give up, but at 0745 something told me to just stop looking and ride, so I did. I think the sun rise helped a lot, it was soon above freezing and everything on the ground had melted! I rode right into rain, light snow, sleet, more rain, oh and don't forget WIND, 25 mph with huge gusts, the wind was relentless and brutal, but no ice, no slush, just water on the road all through PA, MD, WV, then it finally cleared up as I crossed into Virginia!\nI rolled down the highway through Virginia to Marion, VA where my turnaround was going to be, great weather, my only issue was time, remember I had left 4 hours late, and I had to leave for work in the morning at 0430! Time was tight!\nOn the ride down I came up with an ingenious plan to save about 1.5 hours, I would short the ride some miles, turn back early and head to my house, stop and take a nap, then include my 62 mile ride to work as part of the ride, I was still well inside the 24 hour window and would end up with 1023 miles according to my calculations. I'll call this taking the REALLY long way to work\n\nThis worked perfectly, I got home ( riding again in drizzle and a few flakes of snow) at 23:58, slept 3 hours, headed to work, got my final gas receipt at the airport at 0600, and submitted my ride!\nAll 4 seasons achieved!",
  "Breadcrumbs": "Home\nForums\nGeneral Forums\nMotorcycle Stories",
  "Title": "Iron Butt #17 Spring is Sprung",
  "Author": "mike721",
  "URL": "https://www.motorcycleforum.com/threads/iron-butt-17-spring-is-sprung.253473/",
  "Date": "Mar 20, 2024",
  "Tags": []
}]