[{
  "Content": "It was 1967 in Burien, WA when my father bought his first and last Ducati, a 1967 Sebring 350.\n\"Hop on the back, son. I'll take you for a ride.\"\n\nWe ventured down the road a few miles, and it was instant 2-wheel love for me from then on. A person either loves to be on a bike or doesn't. Seems there is no in-between. But I wanted to ride one myself after being two-up with my dad, and on the road at that.\n\nIt's funny how we can recall the smallest details, and why. For me, the geometric headlight can was a focus for me. Seems like it was possibly a polygon. Weird me, taking in the shape of a headlight.\n\nYeah, so I wanted to ride that bike...any bike, on the street just like dad. \"Dad, when can I ride this?\" I didn't particularly like the answer. \"In four more years when you get your license at 16, son.\" Ahhh, the pain! Four years is a week today, but a decade when you're 12 years old.\n\nBut all was not lost, as my dad moved the family out into what was then the country above Issaquah, WA on 2 acres with about 1K acres of dirt, an abandoned gravel pit, and forested trail riding territory right from our home. I had turned 13. So, 2-wheeled heaven came to me in the form of a very basic mini-bike my dad bought from a friend, used, for $40.00. I couldn't be happier! Other than chores, I was on that minibike every spare minute I had, rain or shine.\n\nThat started a thing which continues today at my ripe old age of 70 this year. The bikes got bigger as I made more money working part time through high school, and even did a short stint of flat track racing before I joined the Navy.\n\nMy dad never stopped buying and riding motorcycles either, and I was lucky enough to ride with him on many trips...just the two of us, when I retired from the Navy in 1998, and always with fishing gear on the back of our bikes. Dad became a deputy Sheriff in King County, WA at age 35, and one of his many positions was being a motorcycle cop when they put him on an AMF hog. He loved that job. The bike was in the shop a lot (AMF, right?). We rode in every weather condition you can think of, slept on the ground, in a parking lot, in motels, and even on picnic tables in a very wet park. We rode together until he was 77, when he decided he was pressing his luck. He passed 5 years ago. I'll miss the finest riding buddy and father that, IMO, ever existed.\n\nGot a photo of dad here at 34 years old on his Ducati Sebring in 1967 near North Bend, WA. Note the Cig, boat shoes, T-shirt and no helmet! I think he could have doubled for Steve McQueen!\nPhoto is reversed. I took the slide in to make a print and they messed it up.\n\nCheers!",
  "Breadcrumbs": "Home\nForums\nGeneral Forums\nMotorcycle Stories",
  "Title": "Dear Old Dad Gave Me the Motorcycle Bug in 1967",
  "Author": "Dobson Fly",
  "URL": "https://www.motorcycleforum.com/threads/dear-old-dad-gave-me-the-motorcycle-bug-in-1967.253576/#post-2765428",
  "Date": "Apr 4, 2024",
  "Tags": []
}]