[{
  "Content": "My favorite cornering practice 'track' is a 15-mile stretch of highway 93 over the pass between Montana and Idaho. In both directions there is a lot of double lanes (passing lanes) on the uphill portions ... on the Montana uphill, the whole curvy stretch is one lane down and two up. Both ways have very nice pavement on curves from 2nd gear sweepers into high 4th or 5th. I view it as a great place to develop my cornering skills - pushing closer to the edges so I have the confidence and practice necessary to tighten turns elsewhere if that is required in a tight spot.\n\nYesterday was my first outing on Leo for the year and I wanted to start with that bit of cornering practice ... building from conservative up to wherever reasonable caution took me on 2024's maiden RT ride.\n\nI noticed strips of traction sand where the four wheelers had not dusted it off the road surface, but those patches were few, far between and never in my lines ... until ... they were.\n\nDang! I love those Michelin Road 5s.\n\nI was leaning well into a right-hander with zero traffic. I was centered to the right edge of the middle lane (room to burn on both sides of me). Then I observed an unusual patch of sand on my trajectory - and I was already in it. Leo danced a bit, felt slightly loose, but tracked through it like a champ.\n\nMy community service completed for the day by moving that sand off the correct line, I greatly intensified my concentration on seeing traction sand patches before I felt them. One was enough - and that's exactly what I got. I also cut my ride short, turning around at the top rather than finding how well the Idaho Highway Department had done on sanding and cleanup of their share of my school room.\n\nTomorrow is the first Sunday Morning Breakfast Club run over famous Highway 12 from Lolo to Lochsea. I have to ride an hour of slab before arriving at the starting point which takes a little polish off that apple. I have decided to forgo this one and let the sportier guys and another week or two of regular traffic sweep the traction sand of the sweet corners up and over Lolo Pass.\n\nTip for early season riding where traction sand is use for winter driver safety: Be vewwy vewwy careful.",
  "Breadcrumbs": "Home\nForums\nGeneral Forums\nMotorcycle Training, Safety, and Riding Techniques",
  "Title": "Traction sand isn't ... and other cornering surprises",
  "Author": "Bitterroot Bugler",
  "URL": "https://www.motorcycleforum.com/threads/traction-sand-isnt-and-other-cornering-surprises.253664/",
  "Date": "Apr 13, 2024",
  "Tags": []
}]