[{
  "Content": "I really like my lowered, street-tired, geared-up Dr Zee for short knock-around trips. Still not loving it on the 70-mph artery that leads to just about anywhere from my town, but if I stay close to tiny town, or run the old road to the bigger town (18 miles primarily nice gravel road to Hamilton)\n\nI really like Leo on the open road, and LOVE it on twisties. Considering adding some miles to my area of operation this summer with tank bag and small LEO tail box. Also considering trading it for a non-patrol version with side cases, BUT the super-low 15,000 miles on my fully sorted R1200RT with awesome near-new tires is compelling ... and the transaction cost of changing to a normal one with double, triple or quadruple the miles is intimidating.\n\nI thought the vintage R90/6 would scratch the classic bike itch along with providing a nice intermediate bike between the other two, but it feels like a pig in comparison to either. I think 30-40 years of evolution spoiled me. I'm still working on sorting \"the ultimate vintage\" R90, but skeptical and, therefore, still scheming on \"What do I really want?\".\n\nMy current thinking is primarily to try the R90 again with some details like stiff throttle sorted out. Secondly, I see a couple of nice days coming up that I might spend looking at substitutes for the R90, or for it and Dr Zee.\n\nAt 74.5 years, weight is an issue ... Leo may have to give way to a bike under 450 pounds. I may be giving him up in the not-too-distant future ... oh, but I LOVE the cornering.\n\nThe Seca caught my eye when it came out - and still catches my imagination today.\n\n\nI loved my '72 Brit ... the updates are always catching my eyes\n\n\nThanks to Peter Egan, I am now considering at least a Royal Enfield test ride",
  "Breadcrumbs": "Home\nForums\nGeneral Forums\n🏍 General Motorcycle Discussion 🏍",
  "Title": "considering swapping the steeds in my moto stable",
  "Author": "Bitterroot Bugler",
  "URL": "https://www.motorcycleforum.com/threads/considering-swapping-the-steeds-in-my-moto-stable.253540/",
  "Date": "Mar 30, 2024",
  "Tags": []
}]