[{
  "Content": "So this came up recently after I was following someone riding, and I noticed almost every time they stop they seem to be struggling a bit because they pretty regularly didn't start putting their foot down until after the bike came to a stop. So I brought this up to them, as I would hope someone would do with me if they saw me doing something that clearly could be done more efficiently, and to my surprise they said if they tried to consciously control their foot when coming to a stop, it would mess them up.\n\nThis led to a whole discussion on the subject of conscious vs unconscious control, and it turned out both of us were somewhat amazed by the other's responses, because it seems like we are on far ends of the spectrum. They don't consciously control almost any of their physical movements, they think where they want to go and they go there, any body motions on the way are completely automatic, this includes walking, running, dancing, driving, and riding, etc. We got into a discussion about braking coming into a corner and they had no idea how they did it, they see the corner, think where they want to go, then somehow braking and steering happens.\n\nThis obviously works for them, but it completely blew me away because I am exactly the opposite, almost EVERYTHING physical I do is completely conscious. If I am very used to the activity, it doesnt take a lot of brain power, but I think about every single step I take when walking, running, dancing, driving, riding, swinging an axe or a hammer, etc. I learned how to drive on a stick decades ago and still each shift requires me to think about it, not a lot, but there is always a small process going that I am aware of going \"ok, you are done with 3rd now, time to shift into 4th, or that hill is coming up so downshift into 2nd\". Everything driving and riding is like this, I consciously steer a car, I consciously countersteer my motorcycle, I choose when to brake, how hard, and which brake to use every single time. This completely blew away the other person, we left this conversation with them confused about how I manage to do anything, and me confused about how they can possibly change anything they are doing, but both of our systems seem to work for us.\n\nSo it got me curious, how many function mostly on automatic for physical movements, and how many are mostly consciously choosing each step?",
  "Breadcrumbs": "Home\nForums\nGeneral Forums\n🏍 General Motorcycle Discussion 🏍",
  "Title": "Do your physical movements happen mostly automatically? Or are they mostly consciously chosen?",
  "Author": "Joel_The_Mole",
  "URL": "https://www.motorcycleforum.com/threads/do-your-physical-movements-happen-mostly-automatically-or-are-they-mostly-consciously-chosen.253487/",
  "Date": "Mar 22, 2024",
  "Tags": []
}]