[{
  "Content": "Exploring the Netherlands | Dutch countryside river run | Yamaha Tracer 7 |\n\nSpring ride on the Yamaha Tracer 7 riding into the Vechtstreek following the river Vecht.\nThis is a beautiful part of the Dutch countryside with some nice little winding roads, small villages and great nature panorama's.\n\nFilmed with the GoPro 12\n\nEnjoy the ride, Jaamaan123\n\n\nThe Vecht is a Rhine branch in the Dutch province of Utrecht.\nIt is sometimes called Utrechtse Vecht to avoid confusion with its Overijssel counterpart.\nThe area along the river is called the Vechtstreek.\n\nThe Vecht originates from the city of Utrecht, where the Kromme Rijn stream forks into two branches: the Leidse Rijn/Oude Rijn branch to the west and the Vecht to the north.\nOriginally the Vecht branched off south of the city near the Roman fort Fectio, flowing eastwards around the city, but in the 12th century a northern shortcut was dug out.\n\nThe Vecht meanders north past the towns and villages of Maarssen, Breukelen and Nigtevecht, crosses the border into the province of North Holland, passes the city of Weesp and discharges into the IJmeer (Lake IJ, part of the former Zuiderzee) at Muiden.\nThe Amsterdam-Rijnkanaal (Amsterdam-Rhine Canal) was dug in the Vecht basin.\n\nThe Roman historian Tacitus tells us that in the first century CE a Roman fleet sailed due north down a Rhine branch, then sailed past Lake Flevo (now the Markermeer and IJsselmeer lakes) into the North Sea.\nThis could have been the IJssel, which the Romans connected to the Rhine themselves, or the river Vecht.\nIn the 17th and 18th centuries many country estates, known as buitenplaatsen, were built on the banks of the Vecht by rich merchants and administrators from Amsterdam.",
  "Breadcrumbs": "Home\nForums\nPhotography 📸 & Video 🎦 Forums\n🎦 Videography Showcase 🎦",
  "Title": "Exploring the Netherlands | Dutch countryside river run | Yamaha Tracer 7 |",
  "Author": "Code-red",
  "URL": "https://www.motorcycleforum.com/threads/exploring-the-netherlands-dutch-countryside-river-run-yamaha-tracer-7.253661/",
  "Date": "Apr 13, 2024",
  "Tags": []
}]