[{
  "Content": "I've never been tempted to go to Sturgis or Daytona for their motorcycle rallies. Just too big, too difficult to get motel reservations unless done far, far in advance, etc. Sturgis is always with broiling hot weather, and Daytona would mean trailering my bike that time of year to get there and back. But I used to go to other rallies, at least once a year. Back in the late '80's and early '90's there were the Rider magazine sponsored rallies which were always great fun. And then for many years I went to the Honda Hoot, but I think the last one was in 2009 which is now 15 years ago. For me the best part of the rallies was the chance to ride all sorts of bikes by the manufacturer demo rides available. One Honda Hoot that my youngest son attended with me, we rode at least a dozen different bikes each over the course of about 3 days, something I never would have had the chance to do otherwise. And going to a rally gave me a good destination for a long road trip each year.\n\nI had planned to go to a Wing Ding, but no sooner did I want to go when the whole Goldwing Road Riders Association went out of business and the Wing Dings along with it. A few years back I went to something called (if I recall correctly) \"The Thunder in the Smokies\" in Maggie Valley, NC and it was totally ****. No demo teams, very few vendors and absolutely nothing to make me glad to even spend the entry fee let alone the cost of an entire trip.\n\nAdd to this the endling of the annual Progressive sponsored motorcycle show each winter, and the end of almost all the motorcycle magazines, and I feel rather deprived. I wonder if now that we are past the big recession that started in 2008, past the COVID crisis, and seeing bike sales increasing (I think) that maybe we would see a return of the rallies. I assume Americade is still operating, but I have real problems going to NY for any reason.",
  "Breadcrumbs": "Home\nForums\nGeneral Forums\n🏍 General Motorcycle Discussion 🏍",
  "Title": "Wonder if we will ever see a return to motorcycle rallies as we had just a few years back?",
  "Author": "vito",
  "URL": "https://www.motorcycleforum.com/threads/wonder-if-we-will-ever-see-a-return-to-motorcycle-rallies-as-we-had-just-a-few-years-back.253771/",
  "Date": "Apr 27, 2024",
  "Tags": []
}]