[{
  "Content": "I'm almost 50. I took took the MSF course in December (23) and bought a bike in January '24'. 2014 Yamaha Bolt. I've spent the last four months learning how to control the bike. Slow speed left and right turns. U- turns, twistys (as they are called), neighborhood traffic... kids, animals, golf carts and the occasional stop sign. I practiced emergency breaking.... locking up front and back tires trying to understand what it's like to not have ABS like a car/ truck has and to know what it's like to lay the bike down because of rider error...a mistake. (Dropping a bike sucks!!) Then on to the highway. Accelerating to 65 plus Mph. Merging into to faster traffic. The vibrating helmet, blurry mirrors and wind that reminds me that I'm supposed to trust the bike and my tires but also says never forget.... no walls, no airbags just you, your bike, your gear and what you know about 2 wheels. Daunting for sure. Controlling the bike at slow speed has been the biggest challenge. Cuz it seems the the bike does what it's supposed to do when it's moving faster that 10mph. But when it's moving slow....a different skill set.\n\nI've dropped the bike 3 times since I bought it. Once during a slow planned u-turn, second at an intersection with a car that I didn't see and the third in a parking lot with thick gravel I didn't anticipate. I try to chalk it up to being a new rider. I spent $5k not $25k for that reason. Each time I dropped it, was an angry experience. Pissed cuz I dropped my bike, mad cuz I knew why and pushed forward like an angry new rider saying pick it up and go again.\n\nApril is here. I'm making left and right turns, in the neighborhood. Getting on the highway doing 70+. Making uturns. Merging into faster traffic with more comfort. When do I get to the part when I enjoy the ride??",
  "Breadcrumbs": "Home\nForums\nGeneral Forums\n🏍 General Motorcycle Discussion 🏍",
  "Title": "New rider learning",
  "Author": "synctek",
  "URL": "https://www.motorcycleforum.com/threads/new-rider-learning.253569/",
  "Date": "Apr 3, 2024",
  "Tags": []
}]