[{
  "Content": "Greetings all.\n\nLast summer, dipped my toe into the water by picking up a 1985 Virago 900 to see if I really wanted to get back into bikes. Well, the bike gods bit again so a few weeks ago, I picked up a 2019 Suzuki Boulevard c50T with only 1,000 miles on the dial. Put 500 miles on her in the last few weeks getting familiar with the bike and making the modifications we all make with a new purchase. Obviously, the Virago will go to the next custodian for future ownership.\n\nMods include replacing stock seat with a 2 up Saddlemen Explorer. Definitely improves the ride. LED headlight and turn signal upgrade, Kewig waterproof wireless cellphone charger/holder, wired for and purchased heated gloves (I live in the NJ so winter riding is cold), aftermarket luggage rack, Graber passenger Armrests, mechanical throttle lock, fork deflectors and windshield extender to eliminate buffeting at speed.\n\nHeres what I can say about the boulevard c50T. It's a good middleweight cruiser. Light enough to enjoy the twisties (650 lbs) and powerful enough to stay at 70-75 all day long. Much beyond that, the missing 6th gear becomes obvious and vibration introduces itself. Don't get me wrong, Im not dissing the bike. I get my speed fix on 4 wheels on racetracks in the warmer months so motorcycles north of 75 mph isn't necessary for me. I will say this - For relatively short money, I got into a bike I would have no problem doing 300 mile days (note previous seat upgrade. Wouldn't even attempt on stock seat). Much more than that, your gonna want a few hundred more cc's and a 6th gear at least.\n\nIm really looking forward to the weather breaking in a few months so the wife and I can head out for a few long weekends or even impromptu day trips.\n\nIf you've read this far, thanks for doing so. Feel free to comment.\n\nBest,\n\nJim",
  "Breadcrumbs": "Home\nForums\n🏍 Motorcycle Forums 🏍\nCruiser Forum",
  "Title": "New Member Introduction",
  "Author": "jfhughes08088",
  "URL": "https://www.motorcycleforum.com/threads/new-member-introduction.252982/",
  "Date": "Jan 3, 2024",
  "Tags": []
}]