[{
  "Content": "Hello everyone, first time bike owner here, and I just purchased a 2008 Suzuki GSX650F. It needs new fairings and the previous owner did some unorthodox wiring when installing custom LED lights (which have been removed before purchase) but mechanically it functions beautifully. Or it did at least.\n\nI was aware when I bought it that it would need an oil change. My friend helped me drive it from the seller to my place (about 90 miles) and he had no issues, said it ran beautifully and wishes he could ride it more. I then put about another 20-30 practicing while waiting on my paycheck to get the new oil and filter. It ran perfect.\n\nI got 4 quarts of Lucas 10w40 Synthetic Motorcycle Oil and a K&M filter designed for this bike. I went home, drained the old oil, and removed the filter. After letting it all drip out, I put in 3.5 quarts (online says 3.7 is capacity but I've also read putting a tiny bit less is safer then putting a tiny bit more so I leaned on the lower side. The oil is just below the F line) all after filling the oil filter about halfway and installing that. Cleaned up the bike, turned it on and it started right up. Let it run about 10 minutes then got on and took it for about 2 miles away, turned around, and about 1.8 miles back the engine stalled. Turned right back on, got it home, did some quick runs around my house and it was fine.\n\nNext morning I turned it on, no issue, pulled in the clutch and shifted into first and the bike leaped forward and stalled. Tried again, same result. Tried again from first gear, the starter pushed the bike forward but didn't start. Like the clutch isn't disengaging. The digital gear indicator will go 1,N,2 but if I try to shift to 3 (with the bike off) the screen blanks and it doesn't sound like it's shifting properly. I also noticed once the bike warmed up that it was bogging a bit when in idle, and if I revved to anything above 5k and let off the throttle it stalled about half of the time.\n\nI redid the entire oil change with new oil AND filter and nothing. I even brought it to the F line and still have the issue. It's got a hydraulic clutch so I can't even seem to find help on how to adjust it, as I have read that it is common after a oil change to need to do that. Honestly I can't find anything about this bike except a few botched videos in YouTube.\n\nI would appreciate any advice or help anyone may be able to provide. This has me very irritated and is leaving me with a sour taste, but I know it is fixable so in trying to keep a clear head. Thank you all!",
  "Breadcrumbs": "Home\nForums\n🏍 Motorcycle Forums 🏍\nSportsbike Forum",
  "Title": "GSX650F shifting stuck after oil change, help?",
  "Author": "RyanM8640",
  "URL": "https://www.motorcycleforum.com/threads/gsx650f-shifting-stuck-after-oil-change-help.253257/",
  "Date": "Feb 19, 2024",
  "Tags": [
    "clutch",
    "gsx650f",
    "oil change"
  ]
}]