[{
  "Content": "Hey guys. Bought a 2012 Suzuki boulevard C50T as my first bike with 14,200 miles. Bought back in December 2023 , 26th iv out roughly 800miles on it in the first before changing the oil at 15000 miles. Everything seemed fine. Put another 2500 miles I'm at 17600 and iv used a few \"berryman B-12 fuel treatments....3oz for the 3.5 gallon full tank. Less then recommended. And added new exhaust...cobra slash.. never got it tuned cause I like the backfire. But that was the first thing I did with the oil change. That's a little the back story...the problem (that we think is a problem) I'm replacing the clutch cause the clutch seems to have been going or just recently got worse. Either way we looked at the oil and noticed it's almost empty. Can't even see it in the sight glass. Oil pressure light isn't on so there is some oil in there...but we're not sure where it could have gone...\n\nSo we are thinking...\n\nOption 1: the clutch has been burning up the oil considering I didn't know the clutch has been slipping till recently. The bike shifted funny since we bought it. But has gotten way worse.\n\nOption 2: the engine just happens to burn oil at a higher rate then normal\n\nOption 3: the berryman B12 screwed up the rings and I'm losing oil out the exhaust cause theres no clear wet oil spots anywhere else on the engine. The exhaust is black. It's been raining so we don't know if it's Texas moisture mixed with with carbon soot. It's practically strait piped and backfires almost on every time you roll off the throttle hardly any baffles at all.\nShort of a compression test were not sure. See if this forum has any insight or suggestions of ways to cancel or verify possibilities.",
  "Breadcrumbs": "Home\nForums\nMotorcycle Repair, Building, and Restoration\n🔧 Motorcycle Repair 🔧",
  "Title": "Suzuki c50T 2012 17k miles.",
  "Author": "Brown0344",
  "URL": "https://www.motorcycleforum.com/threads/suzuki-c50t-2012-17k-miles.253624/",
  "Date": "Apr 8, 2024",
  "Tags": ["need inputs"]
}]