[{
  "Content": "So flipping through stuff on fork oil, it seems like almost the entire conversation is always about viscosity, which sure is important, but that is also like a 20 second sound blip: check the cst viscosity @40c and get the right one for your needs. Moving on.\n\nWhen trying to find out other properties of fork oils, like what is their base oil made from? Mineral? Synthetic? How well do they act as lubricants? How long do they hold up? It seems like the entire field of fork oil is just pretty much an unregulated field full of snake oil, maybe even literally snake oil... Also, price and quality dont SEEM to have much overlap here, full synthetics and possibly something made from rendered roadkill seem to be within a few percentage of each other on cost.\n\nSo for the more experienced out there, what do you go by? Any brands that are known to lubricate better and hold up longer? Any guidelines? Or is it all just trial and error? Or should I just get a bucket of AeroShell fluid 31 for the lighterweight needs and use high quality synthetic engine oil for the hamfisted heavier stuff and call it a day?\n\nEdit: After watching this video discussing how viscosity index and lubricity have a fairly inverse relationship, and knowing that fork oil is usually not much above ambient temp, fork oil marketing heavily emphasizing the importance of their high VI rating seems even more like a bunch of hokum, and that getting a good lubricating oil with good anti foaming properties and long term stability would be a lot more important than high viscosity index, at least for street bike forks:\n\n\nIs there something I am missing here? Because the more I look into this the more I think I should just ignore \"fork oil\" for my street bike and just grab something like Mobil1 0W-8 which has a cst of 23 @40C or about what is commonly referred to as 5wt-7wt fork oil, or Mobil1 0W-16 which has a cst of 39.5 @40C or about what is commonly referred to as 7wt-10wt fork oil.",
  "Breadcrumbs": "Home\nForums\nGeneral Forums\n🏍 General Motorcycle Discussion 🏍",
  "Title": "Fork oil differences besides viscosity?",
  "Author": "Joel_The_Mole",
  "URL": "https://www.motorcycleforum.com/threads/fork-oil-differences-besides-viscosity.253437/",
  "Date": "Mar 17, 2024",
  "Tags": []
}]